history = """🔍 Згідно з археологічними відомостями, на території сучасного Краматорська і його найближчих передмість
люди селилися ще з давніх-давен. На північно-західній околиці Краматорська знайдено каменоломні й майстерні з обробки
 кременя епохи неоліту, існування яких тривало й у період ранньої міді.
  У передмісті Краматорська досліджене також курганне поховання металурга-ливаря епохи бронзи.
  
  У часи пізнього середньовіччя землі Донбасу стали частиною Дикого поля (так, саме про нього співає Ярмак). Тут 
  проходив умовний кордон (або "крома" чи "крама") між землями запорізьких та донських козаків, хоча, насправді частіше 
  тут можна було побачити татар  або чумаків (до вугілля "головним продуктом" Донбасу була сіль, а місцеві соляні озера 
  були відомі на всю Європу).

🐴 У другій половині XVII — початку XVIII століття ця частина Слобожанщини масово заселюється козаками з Гетьманщини,
 кріпаками з південних районів Московії та Мордовії.
 
 Є думка, що зародження Краматорська почалося з часів, коли козаки під проводом отамана Степана Таранова зайняли ці 
 землі. Отаман заснував тут свій великий маєток. На початку XVIII століття Таранов розширював територію Запорозької 
 Січі. В поселенні з’явилася нова слобода й було збудовано церкву. Після смерті легендарного отамана селище 
 перейменували на його честь та почали називати Малотаранівкою. 

🏙 1767 уряд Московії віддав графові Ф. Таранову 10 тисяч десятин козацької землі, на яких було засновано село Петрівка.
 Пізніше ці землі було продано шляхетському роду Абаза, згодом — іноземцям Іванову, Шабельському, Штейгерову.
  В результаті виникли нові поселення Абазовка, Іванівка, Шабельківка, Штейгеровка, котрі надалі створили своєрідну 
  агломерацію — Краматорськ.
   В 1799 територію майбутнього Краматорська включено в Ізюмський повіт Слобідсько-Української (пізніше перейменовано у 
   Харківську) губернії.

У другій половині XVIII сторіччя територія, яку нині посідає місто, масово заселяється козаками Слобідського війська.
Місто розвинулося від селища при маленькій залізничній станції, побудованій у 1868 році, до сучасного досить великого 
міста обласного значення, промислового центру й транспортного вузла.
 
 Після того як стало відомо про повалення царського режиму, у Краматорську 2 березня було створено 
 Громадський комітет. За підтримки меншовиків та есерів доктор Демулін виступив у тимчасовому комітеті проти роззброєння 
 поліції, що могло призвести до суспільних безладів, або пропонував роззброїти тільки «поганих» поліцейських.

Повідь (розлив річки Торець), що спіткала Краматорськ навесні 1917 року, не дала організаційному комітету можливості 
провести вибори до Ради робітничих депутатів, Раду було обрано лише 21 березня (за старим стилем).
 Краматорськ був звільнений підрозділами Армії УНР у квітні 1918 р.

З квітня по грудень 1918 року Краматорськ перебував під владою Української Держави гетьмана Павла Скоропадського.
 Після антигетьманського повстання Краматорськ ненадовго перейшов під владу Директорії УНР.

Через поразку УНР в радянсько-українській війні, Краматорськ, як і інші населені пункти Донбасу, опинився під 
радянською владою.

Протягом різних часів поселення мало різні назви: сучасну пов'язують зі сполученням «кром» (укріплення) та «торський» 
(від однойменної річки) 

Перша школа на території сучасного Краматорська була споруджена у Шабельківці у 1885 році. 

Найпершою вулицею, що з’явилася, була вул. Велика (тепер Тріумфальна). 

Найдовшими вулицями є вул. Олекси Тихого та вул. Кірова (зараз Лівобережна) (понад 8 кілометрів). 

Найкоротшою вулицею в Краматорську є провулок Тихий (тепер Великої Сімки), біля якого колись з’явився перший цвинтар.  

Перший у місті 14-поверховий будинок був збудований у 1976 році (Паркова, 16). Краматорськ став першим містом у 
тодішньому СРСР, де у 1932 році стали виготовляти великі шлакоблоки, з яких зводили будинки. 
"""


factori = """“Хрещеним батьком” Краматорська вважають швейцарця Конрада Гампера. За кілька років він збудував тут 
механічний та металургійний заводи (нині – Старокраматорський машинобудівний завод та Краматорський металургійний завод 
ім. Куйбишева). Працювали на ньому німецькі інженери та робітники з Польщі та Чехії, а місцеві мешканці спершу були 
лише різноробами. 

У 1926 році Краматорськ отримав статус міста.  Новокраматорський машинобудівний завод почали будувати в 1929 році та 
завершили першу чергу у 1934 році. 

За проєктом доменника Курако вперше у практиці вітчизняної металургії у Краматорську було побудовано доменну піч із 
скіповим витягом 

не секрет що економика Крамоторьська будуеться на підпримствах, таких таких як:
-НКМЗ - Новокраматорський машинобудівний завод
НКМЗ один із найзначніших світових виробників обладнання для гірничо-металургійної промисловості.
Зосереджений на виготовленні неповторних машин і обладнання, одне з найбільших спеціалізованих підприємств України.
Завод було відкрито 28 вересня 1934
НКМЗ Виготовляє високопотужне сучасне металургійне обладнання, підіймальні машини для шахт Донбасу,гірничодобувні, 
збагачувальні й інші машини та механізми.
З часу заснування на підприємстві спроєктовано і виготовлено
102 вальцювальних стани,
189 міксерів для зберігання і перевезення чавуну, 45 штампувальних молотів,
20 установок для наплавлення конусів і чаш засипних апаратів доменних печей,
142 преси різного призначення, 17 машин для скочування шлаку з чавуновозних ковшів,
103 горизонтально-ковальські машини, близько 2000 крокувальних екскаваторів,
понад 2000 шахтних підіймальних машин, близько 3000 рудо- і вуглемельних млинів,
18 роторних розкривних і добувних комплексів.
-Енергомашспецсталь
«ЕМСС» виробляє обладнання для українських та закордонних підприємств. Зокрема, 2016 року, налагоджено співробітництво 
із такими вітчизняними підприємствами, як «Запоріжсталь» (виготовлення опорних валків), «Азовсталь» (виготовлення 
робочих валків)
до цехів ЕМСС входять
Металургійне виробництво: електросталеплавильний цех, стале-ливарний цех
Кувальне та термічне виробництва: кувально-пресова обробка, термообробка
Механообробне виробництво: механообробний цех, цех механічного устаткування
"""

parc = """у Краматорську є не тільки промисловість а й чудові парки та площі, наприклад:
Сад Бернацького - найстаріший і красивий парк Краматорська.

Сад і дворянська садиба Таранова-Белозерова була закладена тут ще в XIX столітті.
З 1896 року - з тих пір як Конрад Ґампер викупив у Таранова-Белозерова садибу - і по 1917 рік тут жили директори-
розпорядники заводу КМО з сім'ями, зокрема, і директор Краматорського машинобудівного заводу Йозеф Бернацький, тоді за 
цим місцем і закріпилася назва " Сад Бернацького ".
Потім при заводському клубі були створені дві футбольні команди, а цей вид спорту став активно пропагуватися серед 
робітників.

В середині 20-х років з ініціативи та за участю комсомольців тут було посаджено багато молодих дерев.
У парку з'явилася літня естрада, фонтан, літній кінотеатр. В сад пускали за спеціальними перепустками.

У 1936 році в саду був побудований стадіон "Авангард".

У роки німецько-фашистської окупації стадіон був зруйнований, але після звільнення міста був відновлений.

У післявоєнні роки парк став улюбленим місцем відпочинку краматорчан.
Тут проводилися концерти, працювала танцпощадка, буфет, чайна лавка.

У 1950-ті роки в парку Бернацького відкрилася галерея, що складається зі скульптур великих поетів,
письменників і композиторів, і літня естрада.

У 1980-90 роках паркова зона занепала, а до 2000 років і зовсім був покинутий.

У 2016 році місцева влада провели масштабну реконструкцію Сада Бернацького.
Зараз він знову став улюбленим місцем для прогулянок серед краматорчан. Тут вимощені доріжки, скульптури
є місця для відпочинку, а також дитячі ігрові майданчики і мотузковий парк.

ПКіТ НКМЗ — архітектурна перлина Краматорська. Осередок культури і духовності.
Розташований за адресою м. Краматорськ, площа Миру, 1.

На сьогоднішній день в Краматорську існує тільки одна споруда зі статусом «Пам'ятка архітектури».
Палац був побудований за проєктом миколаївських архітекторів В. Н. Коврової, М. А. Шаповаленко, Г. І. Несеченко.
В основу проєкту та кошторисно-фінансових розрахунків ПКіТ НКМЗ лягла документація ПК в Миколаєві.
Єдина відмінність проєкту для краматорського Палацу полягала в тому, що краматорчани відмовилися від штукатурки фасаду 
і вирішили, що облицювальним матеріалом будуть використані гранітні плити та інкерманський камінь.
Але місцеві фахівці не мали досвіду роботи з таким матеріалом. На допомогу прийшли фахівці з Севастополя,
які працювали з інкерманським каменем при зведенні Севастопольського драмтеатру,
інституту ім. Сєченова й інших будівель.

Крейдяні гори Краматорська – це справжній музей просто неба. Тут можна зустріти спіральні раковини амонітів, відбитки 
раковин двостулкових молюсків іноцерамусів, крем’яні наконечники белемнітів, голочки морських їжаків, сіточки мшанок. 
Запаси крейди в районі Краматорська практично невичерпні та становлять 500 мільйонів тонн. 
Всю північну частину Донецької області займало велике море, і нинішня крейда – останки його мешканців.

 Найвища точка 206 метрів над рівнем моря знаходиться біля південно-східного адміністративного кордону міста 
 (район Білокузьминівки). Таку ж висоту має вододіл на південь від витоку балки Шевалда. 
 
 У межах міської забудови найбільшу висоту має Жовтнева гора – 154 метри. 

Перший трамвай у Краматорську було запущено 1 травня 1937 року. Трамвайний рух у місті припинено 1 серпня 2017 року. 
Таким чином трамвай протримався у місті 80 років. 

Бюст Тараса Шевченка, встановлений у сквері його імені, виготовлений зі штучної бронзи зі спеціального високоміцного 
полімерного матеріалу. За рахунок цього вага скульптури вийшла невеликою – близько 100 кг. 
Бюст відкрили до 140-річчя Краматорська.

Найціннішою копалиною Краматорська геологи називають кремінь. За часів палеоліту його застосовували як знаряддя праці. 
Зараз кремній використовують у кульових млинах, електротехніці. Кажуть, що саме в наших місцях первісні люди 
використовували кремінь як сировину та своєрідні гроші."""

